rottenpotatoes/app/controllers/movies_controller.rb

  def director
    @movie = Movie.find(params[:id])
    @director = @movie.director
    @movies = Movie.where(director: @director)
    if @movies.size <= 1 || @movie.director.empty?
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "Andre"]]
SELECT COUNT(*) FROM "movies" WHERE "movies"."director" = ?  [["director", "Andre"]]